#include <iostream>
using namespace std;
int main() {
	//1
	//for (int i = 1; i <= 5; i = i + 1) {
		//cout << i << " " << endl;

	//2
	//for (int i = 5; i >= 1; i = i - 1) {
		//cout << i << " " << endl;

	//3
	/*for (int i = -10; i <= 10; i = i + 2) {
		cout << i << " ";
	}*/

	//4
	//int s = 0;
	//for (int i = 1; i <= 5; i = i + 1) {
	//	s = s + i;
	//	//i = i + 1
	//}
	//cout << s << endl;

	//5
	//вывести таблицу умножения на 3
	//3 * 1= 3
	//3 * 2 = 6
	//3 * 3 = 9

	//6
	/*for(int i = 1; i <= 10; i = i + 1) {
		cout << "3 * " << i << " = " << 3 * i << endl;
	}*/




	//Задачи




	/*1. Составьте программу, выводящую на экран квадраты чисел от 10 до 20.*/
	/*for (int i = 10; i <= 20; i = i + 1)
		cout << i * i << endl;*/

		/*2. Составьте программу, котораЯ вычисляет сумму чисел от 1 до n.значение n вводится с клавиатуры.*/
		/*int n;
		cin >> n;
		for (int i = 1; i <= n; i = i + 1) {
			int y = y + i;
			cout << y << endl;
		}*/
		//3
		/*3. Составьте программу, составьте программу, которая вычисляет произведение чисел от 1 до n.n вводится с клавиатуры.*/
		/*int n;
		cin >> n;
		int v = 1;
		for (int i = 1; i <= n; i = i + 1) {
			v = v * i;
			cout << v << endl;
		}*/
}
